DataProcessors/ПроверкаСчетФактурПолученных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПроверкаСчетФактурПолученных</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/НазваниеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>НазваниеБазы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Альметьевск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Владимир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воронеж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воронеж2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Восток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Казань</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Казань2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Калуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Киров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Краснодар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Краснодар2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Липецк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Молодогвардейская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НабережныеЧелны</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НижнийНовгород</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пенза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пятигорск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ростов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ростов2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рязань</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Самара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Саранск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Север</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тамбов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тверь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тула</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ульяновск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Чебоксары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шахты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮГ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ярославль</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ПроверкаСчетФактурПолученных/Ext/ObjectModule.bsl
Процедура ВыполнитьПроверку() Экспорт 
	
	Запрос  = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ПоступлениеТоваровУслуг.Ссылка КАК ДокументОснование,
	                |	СчетФактураПолученный.Ссылка КАК СчетФактура,
	                |	""Отсутствует счет-фактура"" КАК ТекстОшибка
	                |ИЗ
	                |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
	                |		ПО (СчетФактураПолученный.ДокументОснование = ПоступлениеТоваровУслуг.Ссылка)
	                |ГДЕ
	                |	ПоступлениеТоваровУслуг.Дата МЕЖДУ &ДатаН И &ДатаК
	                |	И ПоступлениеТоваровУслуг.Проведен
	                |	И СчетФактураПолученный.Ссылка ЕСТЬ NULL 
	                |	И ПоступлениеТоваровУслуг.Организация = &Организация
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ПоступлениеТоваровУслуг.Ссылка,
	                |	СчетФактураПолученный.Ссылка,
	                |	""Счет-фактура не проведена""
	                |ИЗ
	                |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
	                |		ПО (СчетФактураПолученный.ДокументОснование = ПоступлениеТоваровУслуг.Ссылка)
	                |ГДЕ
	                |	ПоступлениеТоваровУслуг.Дата МЕЖДУ &ДатаН И &ДатаК
	                |	И ПоступлениеТоваровУслуг.Проведен
	                |	И НЕ СчетФактураПолученный.Ссылка ЕСТЬ NULL 
	                |	И НЕ СчетФактураПолученный.Проведен
	                |	И ПоступлениеТоваровУслуг.Организация = &Организация";
	
	
	Запрос.УстановитьПараметр("ДатаН",НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаК",КонецДня(ДатаОкончания));
	
	ТекущаяБаза = Константы.База.Получить();
	Если ТекущаяБаза = Перечисления.НазваниеБазы.Воронеж 
		ИЛИ ТекущаяБаза = Перечисления.НазваниеБазы.Казань Тогда 
		Запрос.УстановитьПараметр("Организация", Константы.ОсновнаяОрганизация.Получить());
	Иначе      
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПоступлениеТоваровУслуг.Организация = &Организация","");
	КонецЕсли;
	
	ТЗОшибок = Запрос.Выполнить().Выгрузить();
	
	Если ТЗОшибок.Количество()<> 0 Тогда 
		
		
		ТабДокумент = Новый ТабличныйДокумент;
		
		ТабДокумент.АвтоМасштаб  = Истина;
		ТабДокумент.ОтображатьСетку = Ложь;
		ТабДокумент.ОриентацияСтраницы      = ОриентацияСтраницы.Ландшафт;
		
		Макет       = ПолучитьМакет("ОшибкиСФ");
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.ДатаН = Формат(ДатаНачала,"ДФ=dd.MM.yyyy");
		ОбластьМакета.Параметры.ДатаК = Формат(ДатаОкончания,"ДФ=dd.MM.yyyy");
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		Для Каждого ТекСтрока Из ТЗОшибок Цикл
			
			ОбластьМакета.Параметры.Заполнить(ТекСтрока);
			ТабДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла;
		
		ТабДокумент.ТолькоПросмотр = Истина;
		ТабДокумент.Показать();
		
	КонецЕсли;	
	
КонецПроцедуры
